INSERT INTO LoginData (Username, Password)
VALUES
('kasoo', 'root'),
('murashov123', 'qwerty'),
('test1', 'test1'),
('perinaAD', '250519'),
('krutiha1234567', '1234567890'),
('login1', 'pass1'),
('login2', 'pass2'),
('login3', 'pass3'),
('login4', 'pass4'),
('login5', 'pass5');

INSERT INTO UserTypes (Name, Description)
VALUES
(N'Менеджер', N'Управляет процессами'),
(N'Мастер', N'Выполняет ремонт'),
(N'Оператор', N'Обрабатывает заявки'),
(N'Заказчик', N'Создает заявки');

INSERT INTO Users (FirstName, LastName, Patronymic, Phone, LoginDateID, UserTypeID)
VALUES
('Никита', 'Трубин', 'Юрьевич', '89210563128', 1, 1),
('Андрей', 'Мурашов', 'Юрьевич', '89535078985', 2, 2),
('Андрей', 'Степанов', 'Викторович', '89210673849', 3, 2),
('Анастасия', 'Перина', 'Денисовна', '89990563748', 4, 3),
('Ксения', 'Мажитова', 'Сергеевна', '89994563847', 5, 3),
('Ясмина', 'Семенова', 'Марковна', '89994563847', 6, 2),
('Эмилия', 'Баранова', 'Марковна', '89994563841', 7, 4),
('Алиса', 'Егорова', 'Платоновна', '89994563842', 8, 4),
('Максим', 'Титов', 'Иванович', '89994563843', 9, 4),
('Марк', 'Иванов', 'Максимович', '89994563844', 10, 2);

INSERT INTO Techs (TechTypeName, Manufacturer, Mode)
VALUES
('Фен', 'Ладомир', 'ТА112 белый'),
('Тостер', 'Redmond', 'RT-437 черный'),
('Холодильник', 'Indesit', 'DS 316 W белый'),
('Стиральная машина', 'DEXP', 'WM-F610NTMA/WW белый'),
('Мультиварка', 'Redmond', 'RMC-M95 черный'),
('Фен', 'Ладомир', 'ТА113 чёрный'),
('Холодильник', 'Indesit', 'DS 314 W серый');

INSERT INTO OrdersStatus (Name, Description)
VALUES
(N'В процессе ремонта', N'Заявка в процессе ремонта'),
(N'Готова к выдаче', N'Заявка готова к выдаче'),
(N'Новая заявка', N'Новая заявка');

INSERT INTO RepairParts (Name, Description)
VALUES
('Мотор обдува морозильной камеры холодильника', 'Мотор обдува морозильной камеры холодильника');

INSERT INTO Orders (CustomerID, MasterEmployeeID, OrderDate, TechID, Description, OrderStatusID, CompletionDate, RepairPartsID)
VALUES
(7, 2, '2023-06-06', 1, N'Перестал работать', 1, NULL, NULL),
(7, 3, '2023-05-05', 2, N'Перестал работать', 1, NULL, NULL),
(8, 2, '2022-07-07', 3, N'Не морозит одна из камер холодильника', 2, '2023-01-01', NULL),
(8, NULL, '2023-08-02', 4, N'Перестали работать многие режимы стирки', 3, NULL, NULL),
(9, NULL, '2023-08-02', 5, N'Перестала включаться', 3, NULL, NULL),
(7, 2, '2023-08-02', 6, N'Перестал работать', 2, '2023-08-03', NULL),
(8, 2, '2023-07-09', 7, N'Гудит, но не замораживает', 2, '2023-08-03', 1);

INSERT INTO Comments (Message, MasterEmployeeID, OrderID)
VALUES
(N'Интересная поломка', 2, 1),
(N'Очень странно, будем разбираться!', 3, 2),
(N'Скорее всего потребуется мотор обдува!', 2, 7),
(N'Интересная поломка', 2, 1),
(N'Очень странно, будем разбираться!', 3, 6);